lvx/base/Documents/бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийКазначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКратностьДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/AccumulationRegisters/бит_кзн_ПланируемыйРасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_кзн_ПланируемыйРасходДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/AccumulationRegisters/бит_кзн_ПланируемоеПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_кзн_ПланируемоеПоступлениеДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ВидыОперацийКазначейства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийКазначейства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствВДругуюОрганизацию</Name>
					<Comment>Для наличных и безналичных расчетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаздатчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыЧерезКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНаДепозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеТаможне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяВыдачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВариантыОтчетов
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ИнтеграцияИСПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВариантыОтчетов

#Область ОбновлениеИнформационнойБазы

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьКОбработкеДокументыБезМестаХраненияДС(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Дата УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Дата УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПозицияПоступления КАК РеквизитыПозицияПоступления
	|		ПО (РеквизитыПозицияПоступления.ДокументПланирования = Реквизиты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК РеквизитыПлатежнойПозиции
	|		ПО (РеквизитыПлатежнойПозиции.ДокументПланирования = Реквизиты.Ссылка)
	|ГДЕ
	|	(Реквизиты.БанковскийСчет <> РеквизитыПлатежнойПозиции.БанковскийСчет
	|			ИЛИ Реквизиты.Касса <> РеквизитыПлатежнойПозиции.Касса
	|			ИЛИ Реквизиты.БанковскийСчетПолучатель <> РеквизитыПозицияПоступления.БанковскийСчет
	|			ИЛИ Реквизиты.КассаПолучатель <> РеквизитыПозицияПоступления.Касса)";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ОбработатьДокументыБезМестаХраненияДСОтложенно(Параметры) Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если НЕ ЗначениеЗаполнено(ОбновляемыеДанные) Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
											Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылки", ОбновляемыеДанные.ВыгрузитьКолонку("Ссылка"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	РеквизитыПлатежнойПозиции.БанковскийСчет КАК БанковскийСчет,
	|	РеквизитыПлатежнойПозиции.Касса КАК Касса,
	|	РеквизитыПозицияПоступления.БанковскийСчет КАК БанковскийСчетПолучатель,
	|	РеквизитыПозицияПоступления.Касса КАК КассаПолучатель
	|ИЗ
	|	Документ.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПозицияПоступления КАК РеквизитыПозицияПоступления
	|		ПО (РеквизитыПозицияПоступления.ДокументПланирования = Реквизиты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_кзн_ПлатежнаяПозиция КАК РеквизитыПлатежнойПозиции
	|		ПО (РеквизитыПлатежнойПозиции.ДокументПланирования = Реквизиты.Ссылка)
	|ГДЕ
	|	Реквизиты.Ссылка В (&Ссылки)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();

	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			бит_ОбновлениеИнформационнойБазыБФ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Выборка.Ссылка);
		КонецПопытки;		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые документы ""Заявка на перемещение денежных средств"" (пропущены): %1'; 
								|en = 'Some documents ""Application for the movement of funds"" could not be processed (skipped): %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция документов ""Заявка на перемещение денежных средств"": %1';
								|en = 'The next batch of documents ""Application for the movement of funds"" has been processed: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет новый статус объекта в зависимости от режима записи документа
//и предыдущего статуса. Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   НовыйСтатус - СправочникСсылка.бит_СтатусыОбъектов.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Если ПараметрыУстановкиСтатуса.ПараметрыОплаты = Неопределено Тогда
		СтруктураРасход      = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ПолучитьОстатокРасход(ТекущийОбъект.Ссылка);
		СтруктураПоступления = Документы.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств.ПолучитьОстатокПоступление(ТекущийОбъект.Ссылка);
		СтруктураОплаты = Новый Структура("Расход, Поступление", СтруктураРасход, СтруктураПоступления);
	Иначе	
		СтруктураОплаты = ПараметрыУстановкиСтатуса.ПараметрыОплаты;
	КонецЕсли;
	
	РежимЗаписи = ПараметрыУстановкиСтатуса.РежимЗаписи;
	
	ПроводитьПослеУтверждения = ОбщегоНазначения.ЕстьРеквизитОбъекта("ОтправленНаСогласование", ТекущийОбъект.Метаданные())
									И ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");
									
	Если ПроводитьПослеУтверждения Тогда
		Если НЕ ТекущийОбъект.ОтправленНаСогласование Тогда
			Возврат Справочники.бит_СтатусыОбъектов.Черновик;
		КонецЕсли;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Запись И НЕ ТекущийОбъект.Проведен) Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Черновик;
	КонецЕсли;
	
	БезПоступлений = бит_ОбщегоНазначенияПовтИсп.ЗначениеПеременной("бит_кзн_НеСоздаватьДокументыПоступления");
	
	СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	
	Если бит_ВизированиеСервер.ЕстьБлокирующиеРешения(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Отклонен;
		
	ИначеЕсли (БезПоступлений ИЛИ СтруктураОплаты.Поступление.Остаток <= 0.01 И СтруктураОплаты.Поступление.Факт > 0)
			И СтруктураОплаты.Расход.Остаток <= 0.01 И СтруктураОплаты.Расход.Факт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Оплачен;
		
	ИначеЕсли СтруктураОплаты.Поступление.Факт > 0 ИЛИ СтруктураОплаты.Расход.Факт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.ЧастичноОплачен;
		
		
	ИначеЕсли бит_ВизированиеСервер.ВсеВизыСогласованы(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Утвержден;
		
	КонецЕсли;
	
	Возврат Справочники.бит_СтатусыОбъектов.НаСогласовании;
	
КонецФункции

//  Функция создает платежный документ.
//
// Параметры:
//  ПараметрыДокумента - См. бит_Казначейство.НовыеПараметрыСозданияПлатежногоДокумента().
//
// Возвращаемое значение:
//  ПлатежныеДокументы - Массив.
//
Функция СоздатьПлатежныйДокументНаОсновании(ПараметрыДокумента) Экспорт 

	ДокументОснование = ПараметрыДокумента.ДокументОснование;
	СуммаКОплате	  = ПараметрыДокумента.СуммаКОплате;
	ИзРеестра		  = ПараметрыДокумента.ВызовИзРеестра;
	РежимЗаписи 	  = ПараметрыДокумента.РежимЗаписи;
									
	Отказ = Ложь;
	бит_Казначейство.ПроверитьПлатежныеПозицииИзРеестраПоИсточникуВызова(Неопределено, ПараметрыДокумента, Отказ);
	Если Отказ Тогда
		Возврат Новый Массив;
	КонецЕсли;
								
	ПлатежныеДокументы   = Новый Массив;
	СоздаватьПоступления = НЕ бит_ОбщегоНазначенияПовтИсп.ЗначениеПеременной("бит_кзн_НеСоздаватьДокументыПоступления");
	РеквизитыОснования 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, 
								"Организация, ВалютаДокумента, СуммаДокумента, ХозяйственнаяОперация, Ссылка");
	
	Если ИзРеестра Тогда
		СуммаДокумента	 = ПараметрыДокумента.СуммаКОплате;
		ФактическаяСумма = ПараметрыДокумента.СуммаКОплате;
	Иначе 
		СуммаДокумента	 = РеквизитыОснования.СуммаДокумента;
		ФактическаяСумма = 0;
	КонецЕсли; 

    СценарийФакт = бит_НастройкиПрограммы.СценарийОтраженияФактаБДДС(РеквизитыОснования.Организация, ТекущаяДатаСеанса());	
							
    Если НЕ ЗначениеЗаполнено(СценарийФакт) Тогда
		СценарийФакт = Справочники.СценарииПланирования.ФАКТ;
	КонецЕсли; 

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИзРеестра", 			 ИзРеестра);
	ПараметрыЗаполнения.Вставить("СоздаватьПоступления", СоздаватьПоступления);
	ПараметрыЗаполнения.Вставить("ПлатежныеДокументы", 	 ПлатежныеДокументы);
	ПараметрыЗаполнения.Вставить("СуммаДокумента", 		 СуммаДокумента);
	ПараметрыЗаполнения.Вставить("ФактическаяСумма", 	 ФактическаяСумма);
	ПараметрыЗаполнения.Вставить("СценарийФакт", 	 	 СценарийФакт);
	
	ВидОперации = бит_Казначейство.ХозяйственнаяОперацияУП(РеквизитыОснования.ХозяйственнаяОперация);

	Попытка
		НачатьТранзакцию();
		
		Если ВидОперации = Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк Тогда
			ЗаполнитьСдачуДенежныхСредствВБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
		ИначеЕсли ВидОперации = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу Тогда	
			ЗаполнитьВыдачуДенежныхСредствВДругуюКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
		ИначеЕсли ВидОперации = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет Тогда	
			ЗаполнитьПеречислениеДенежныхСредствНаДругойСчет(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
		ИначеЕсли ВидОперации = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка Тогда
			ЗаполнитьПоступлениеДенежныхСредствИзБанка(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
		ИначеЕсли ВидОперации = Перечисления.ХозяйственныеОперации.ИнкассацияДенежныхСредствИзБанка Тогда
			ЗаполнитьИнкассациюДенежныхСредствИзБанка(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
		ИначеЕсли ВидОперации = Перечисления.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк Тогда 	
			ЗаполнитьИнкассациюДенежныхСредствВБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ПлатежныеДокументы.Очистить();
		
		ТекстСообщения = НСтр("ru = 'Не удалось записать документы оплаты по причине: %1.'; 
								|en = 'Failed to record payment documents due to: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для каждого Документ Из ПлатежныеДокументы Цикл
			Попытка
				ТекущийОбъект = Документ.ПолучитьОбъект();
				ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось провести документ оплаты по причине: %1.'; 
										|en = 'Failed to record payment document due to: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ);
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПлатежныеДокументы;
	
КонецФункции

//  Функция получает неоплаченный остаток по расходованию.
//
// Параметры:
//   ДокументПланирования - ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеСредств
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстатокРасход(ДокументПланирования) Экспорт

	СтрОплата = Новый Структура("План, Факт, Остаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументПланирования);
	Запрос.УстановитьПараметр("Организация"         , ДокументПланирования.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПланируемыйРасход.СуммаКонечныйОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(ПланируемыйРасход.СуммаПриход, 0) КАК СуммаПлан,
	|	ЕСТЬNULL(ПланируемыйРасход.СуммаРасход, 0) КАК СуммаФакт
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			ДокументПланирования = &ДокументПланирования
	|				И Организация = &Организация) КАК ПланируемыйРасход";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтрОплата.План    = Выборка.СуммаПлан;
		СтрОплата.Факт    = Выборка.СуммаФакт;
		СтрОплата.Остаток = Выборка.СуммаОстаток;
	
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстаток()

//  Функция получает неоплаченный остаток по поступлению.
//
// Параметры:
//   ДокументПланирования - ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеСредств
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстатокПоступление(ДокументПланирования) Экспорт

	СтрОплата = Новый Структура("План, Факт, Остаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументПланирования);
	Запрос.УстановитьПараметр("Организация"         , ДокументПланирования.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПланируемоеПоступление.СуммаКонечныйОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(ПланируемоеПоступление.СуммаПриход, 0) КАК СуммаПлан,
	|	ЕСТЬNULL(ПланируемоеПоступление.СуммаРасход, 0) КАК СуммаФакт
	|ИЗ
	|	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			ДокументПланирования = &ДокументПланирования
	|				И Организация = &Организация) КАК ПланируемоеПоступление";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтрОплата.План    = Выборка.СуммаПлан;
		СтрОплата.Факт    = Выборка.СуммаФакт;
		СтрОплата.Остаток = Выборка.СуммаОстаток;
	
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстаток()

// Функция получает плановую и фактическую сумму оплат по позиции.
//
// Параметры:
//  Позиция	 - ДокументСсылка.бит_кзн_ПозицияПоступления - позиция поступления.
// 
// Возвращаемое значение:
//  СтруктураРезультат - Структура: структура.
//
Функция СтруктураОплатыПоЗаявкеНаПеремещение(Заявка) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("СуммаПлан"	 , 0);
	СтруктураРезультат.Вставить("СуммаОплата", 0);
	СтруктураРезультат.Вставить("Разность"	 , 0);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", Заявка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ПоступлениеПлан.СуммаКонечныйОстаток, 0) + ЕСТЬNULL(РасходПлан.СуммаКонечныйОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(ПоступлениеПлан.СуммаПриход, 0) + ЕСТЬNULL(РасходПлан.СуммаПриход, 0) КАК СуммаПлан,
	               |	ЕСТЬNULL(ПоступлениеПлан.СуммаРасход, 0) + ЕСТЬNULL(РасходПлан.СуммаРасход, 0) КАК СуммаФакт
	               |ИЗ
	               |	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ОстаткиИОбороты(, , , , ДокументПланирования = &ДокументПланирования) КАК ПоступлениеПлан,
	               |	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.ОстаткиИОбороты(, , , , ДокументПланирования = &ДокументПланирования) КАК РасходПлан";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураРезультат.СуммаПлан   = Выборка.СуммаПлан;
		СтруктураРезультат.СуммаОплата = Выборка.СуммаФакт;
		СтруктураРезультат.Разность    = Выборка.СуммаОстаток;
		
	КонецЕсли; 

	Возврат СтруктураРезультат;
	
КонецФункции

Функция ИспользованиеРеквизитовПоХозяйственнойОперации(ХозяйственнаяОперация) Экспорт

	ИспользованиеРеквизитов = Новый Структура;
	ИспользованиеРеквизитов.Вставить("БанковскийСчет", Ложь);
	ИспользованиеРеквизитов.Вставить("БанковскийСчетПолучатель", Ложь);
	ИспользованиеРеквизитов.Вставить("Касса", Ложь);
	ИспользованиеРеквизитов.Вставить("КассаПолучатель", Ложь);
		
	Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу Тогда
		
		ИспользованиеРеквизитов.Касса 			= Истина;
		ИспользованиеРеквизитов.КассаПолучатель = Истина;
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк 
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк Тогда		
		
		ИспользованиеРеквизитов.БанковскийСчетПолучатель = Истина;
		ИспользованиеРеквизитов.Касса					 = Истина;
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка 
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка Тогда		
		
		ИспользованиеРеквизитов.КассаПолучатель = Истина;
		ИспользованиеРеквизитов.БанковскийСчет 	= Истина;
		
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет Тогда	
		
		ИспользованиеРеквизитов.БанковскийСчет 			 = Истина;
		ИспользованиеРеквизитов.БанковскийСчетПолучатель = Истина;
		
	КонецЕсли;	
	
	Возврат ИспользованиеРеквизитов;
	
КонецФункции

Процедура ЗаполнитьРеквизитыДокументаПоХозяйственнойОперации(Объект) Экспорт
	
	Если Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу Тогда
		
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация  = Объект.Организация;
		СтруктураПараметров.Касса        = Объект.Касса;
		
		Объект.Касса = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
		Объект.ВалютаДокумента = Справочники.Кассы.ПолучитьРеквизитыКассы(Объект.Касса).Валюта;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет Тогда
		
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация      = Объект.Организация;
		СтруктураПараметров.БанковскийСчет   = Объект.БанковскийСчет;
		
		Объект.БанковскийСчет = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
		Объект.ВалютаДокумента = Справочники.БанковскиеСчетаОрганизаций.ПолучитьРеквизитыБанковскогоСчетаОрганизации(Объект.БанковскийСчет).Валюта;
	КонецЕсли;
	
	Если Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка 
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу Тогда
		
		ОрганизацияПолучатель = Объект.Организация;
		
		КассаПолучатель = Справочники.Кассы.ПолучитьКассуПоУмолчанию(
			ОрганизацияПолучатель,
			Объект.ВалютаДокумента);
		Если ЗначениеЗаполнено(КассаПолучатель) Тогда
			Объект.КассаПолучатель = КассаПолучатель;
		КонецЕсли;
		
	ИначеЕсли Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк 
		ИЛИ Объект.ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет Тогда
		ОрганизацияПолучатель = Объект.Организация;
		
		БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(
			ОрганизацияПолучатель,
			Объект.ВалютаДокумента);
		Если ЗначениеЗаполнено(БанковскийСчетПолучатель) Тогда
			Объект.БанковскийСчетПолучатель = БанковскийСчетПолучатель;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция СтатьяОборотовПоВидуОперации(ХозяйственнаяОперация) Экспорт
	
	СтатьяОборотов = Справочники.бит_СтатьиОборотов.ПустаяСсылка();
	
	Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк Тогда
		СтатьяОборотов = Справочники.бит_СтатьиОборотов.СдачаДенежныхСредствВБанк_РасходованиеПоКассе;
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу Тогда
		СтатьяОборотов = Справочники.бит_СтатьиОборотов.ВыдачаДенежныхСредствВДругуюКассу;
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПеречислениеДенежныхСредствНаДругойСчет Тогда
		СтатьяОборотов = Справочники.бит_СтатьиОборотов.ПеречислениеДенежныхСредствНаДругойСчет_расходование;
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ПоступлениеДенежныхСредствИзБанка
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствИзБанка Тогда
		СтатьяОборотов = Справочники.бит_СтатьиОборотов.ПоступлениеДенежныхСредствИзБанка_РасходПоБанку;
	КонецЕсли;
	
	Возврат СтатьяОборотов;
	
КонецФункции

Функция ФормаОплатыПоВидуОперации(ХозяйственнаяОперация) Экспорт
	
	ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
	
	Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВыдачаДенежныхСредствВДругуюКассу
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ИнкассацияДенежныхСредствВБанк
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.СдачаДенежныхСредствВБанк Тогда
		ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Наличные;
	КонецЕсли;
	
	Возврат ФормаОплаты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПозиций(ДокументОснование)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлатежныеПозиции.БанковскийСчет КАК БанковскийСчет,
	|	ПлатежныеПозиции.Касса КАК Касса,
	|	ПлатежныеПозиции.Ссылка КАК Позиция,
	|	ПлатежныеПозиции.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ПлатежныеПозиции.СтатьяОборотов КАК СтатьяОборотов,
	|	ПлатежныеПозиции.ДатаПлан КАК Дата
	|ПОМЕСТИТЬ ВТ_ПлатежныеПозиции
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежныеПозиции
	|ГДЕ
	|	ПлатежныеПозиции.ДокументПланирования = &ДокументПланирования
	|	И НЕ ПлатежныеПозиции.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПозицииПоступления.БанковскийСчет КАК БанковскийСчет,
	|	ПозицииПоступления.Касса КАК Касса,
	|	ПозицииПоступления.Ссылка КАК Позиция,
	|	ПозицииПоступления.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ПозицииПоступления.СтатьяОборотов КАК СтатьяОборотов,
	|	ПозицииПоступления.ДатаПлан КАК Дата
	|ПОМЕСТИТЬ ВТ_ПозицииПоступления
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК ПозицииПоступления
	|ГДЕ
	|	ПозицииПоступления.ДокументПланирования = &ДокументПланирования
	|	И НЕ ПозицииПоступления.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПлатежныеПозиции.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_ПлатежныеПозиции.Касса КАК Касса,
	|	ВТ_ПлатежныеПозиции.Позиция КАК Позиция,
	|	ВТ_ПлатежныеПозиции.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_ПлатежныеПозиции.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТ_ПлатежныеПозиции.Дата КАК Дата,
	|	ЕСТЬNULL(ПланируемыйРасходДенежныхСредств.СуммаОстаток, 0) КАК Сумма,
	|	"""" КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ_ПлатежныеПозиции КАК ВТ_ПлатежныеПозиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.Остатки(
	|				,
	|				Позиция В
	|					(ВЫБРАТЬ
	|						ВТ_ПлатежныеПозиции.Позиция КАК Позиция
	|					ИЗ
	|						ВТ_ПлатежныеПозиции КАК ВТ_ПлатежныеПозиции)) КАК ПланируемыйРасходДенежныхСредств
	|		ПО ВТ_ПлатежныеПозиции.Позиция = ПланируемыйРасходДенежныхСредств.Позиция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПозицииПоступления.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_ПозицииПоступления.Касса КАК Касса,
	|	ВТ_ПозицииПоступления.Позиция КАК Позиция,
	|	ВТ_ПозицииПоступления.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ВТ_ПозицииПоступления.СтатьяОборотов КАК СтатьяОборотов,
	|	ВТ_ПозицииПоступления.Дата КАК Дата,
	|	ЕСТЬNULL(ПланируемоеПоступлениеДенежныхСредств.СуммаОстаток, 0) КАК Сумма,
	|	"""" КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ_ПозицииПоступления КАК ВТ_ПозицииПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.Остатки(
	|				,
	|				Позиция В
	|					(ВЫБРАТЬ
	|						ВТ_ПозицииПоступления.Позиция КАК Позиция
	|					ИЗ
	|						ВТ_ПозицииПоступления КАК ВТ_ПозицииПоступления)) КАК ПланируемоеПоступлениеДенежныхСредств
	|		ПО ВТ_ПозицииПоступления.Позиция = ПланируемоеПоступлениеДенежныхСредств.Позиция";
	
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументОснование);
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаРасход = Результат[2].Выбрать();
	ВыборкаПриход = Результат[3].Выбрать();	
	
	КлючиСтруктуры 	   = "БанковскийСчет, Касса, Позиция, НазначениеПлатежа, СтатьяОборотов, Дата, Сумма, ИдентификаторСтроки";
	ПлатежнаяПозиция   = Новый Структура(КлючиСтруктуры);
	ПозицияПоступления = Новый Структура(КлючиСтруктуры);
	
	Пока ВыборкаРасход.Следующий() Цикл	
		ЗаполнитьЗначенияСвойств(ПлатежнаяПозиция, ВыборкаРасход);
	КонецЦикла;
	
	Пока ВыборкаПриход.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПозицияПоступления, ВыборкаПриход);
	КонецЦикла;
	
	ДанныеПозиций = Новый Структура;
	ДанныеПозиций.Вставить("ПлатежнаяПозиция",	 ПлатежнаяПозиция);
	ДанныеПозиций.Вставить("ПозицияПоступления", ПозицияПоступления);
	
	Возврат ДанныеПозиций;

КонецФункции

Процедура ЗаполнитьИнкассациюДенежныхСредствВБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
	
	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	
	СоздаватьПоступления = ПараметрыЗаполнения.СоздаватьПоступления;
	СуммаДокумента	 	 = ПараметрыЗаполнения.СуммаДокумента;
	ФактическаяСумма 	 = ПараметрыЗаполнения.ФактическаяСумма;
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ИнкассацияДенежныхСредствВБанк);	
								
	ДокументОбъект 		= Документы.РасходныйКассовыйОрдер.СоздатьДокумент();	
	ДокументОбъект.Дата = ДанныеПозиций.ПлатежнаяПозиция.Дата;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	
	ПлатежныеПозиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПозиций.ПлатежнаяПозиция);
	ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, ПлатежныеПозиции, ПараметрыЗаполнения);		
		
	Если СоздаватьПоступления Тогда
		ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
								Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет);
		
		ДокументОбъект		= Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент();
		ДокументОбъект.Дата = ДанныеПозиций.ПозицияПоступления.Дата;		
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		ДокументОбъект.Записать();
		
		ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
		
		ПлатежныеПозиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПозиций.ПозицияПоступления);
		ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, ПлатежныеПозиции, ПараметрыЗаполнения);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьИнкассациюДенежныхСредствИзБанка(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
	
	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	СуммаДокумента	  = ПараметрыЗаполнения.СуммаДокумента;
	ФактическаяСумма  = ПараметрыЗаполнения.ФактическаяСумма;
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.СнятиеНаличныхДенежныхСредств);

	ДокументОбъект 			= Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент();
	ДокументОбъект.Дата 	= ДанныеПозиций.ПлатежнаяПозиция.Дата;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	Платежныепозиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПозиций.ПлатежнаяПозиция);
	
	ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, Платежныепозиции, ПараметрыЗаполнения);
	
	ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ИнкассацияДенежныхСредствИзБанка);
	
	ДокументОбъект = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДанныеПозиций.ПозицияПоступления.Дата;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();

	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	
	Платежныепозиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПозиций.ПозицияПоступления);
	ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, Платежныепозиции, ПараметрыЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьПоступлениеДенежныхСредствИзБанка(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
	
	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	СуммаДокумента	  = ПараметрыЗаполнения.СуммаДокумента;
	ФактическаяСумма  = ПараметрыЗаполнения.ФактическаяСумма;
	
	ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка);	
	
	ДокументОбъект		= Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДанныеПозиций.ПозицияПоступления.Дата;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();

	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	
	Платежныепозиции = Новый Массив;
	Платежныепозиции.Добавить(ДанныеПозиций.ПлатежнаяПозиция);
	Платежныепозиции.Добавить(ДанныеПозиций.ПозицияПоступления);
	
	ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, Платежныепозиции, ПараметрыЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьПеречислениеДенежныхСредствНаДругойСчет(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
	
	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	
	СуммаДокумента	  	 = ПараметрыЗаполнения.СуммаДокумента;
	ФактическаяСумма  	 = ПараметрыЗаполнения.ФактическаяСумма;
	СоздаватьПоступления = ПараметрыЗаполнения.СоздаватьПоступления;
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет);
	
	ДокументОбъект 		= Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент();
	ДокументОбъект.Дата = ДанныеПозиций.ПлатежнаяПозиция.Дата;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();

	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	
	Платежныепозиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПозиций.Платежнаяпозиция);
	ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, Платежныепозиции, ПараметрыЗаполнения);
	
	Если СоздаватьПоступления Тогда
		ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
								Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствСДругогоСчета);
		
		ДокументОбъект		= Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент();
		ДокументОбъект.Дата = ДанныеПозиций.ПозицияПоступления.Дата;		
		РеквизитыВходящего 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.Ссылка, 
									"НомерВходящегоДокумента, ДатаВходящегоДокумента");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, РеквизитыВходящего);
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		ДокументОбъект.Записать();
		
		ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
		
		Платежныепозиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПозиций.ПозицияПоступления);
		ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, Платежныепозиции, ПараметрыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВыдачуДенежныхСредствВДругуюКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)

	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	
	СуммаДокумента	  	 = ПараметрыЗаполнения.СуммаДокумента;
	ФактическаяСумма  	 = ПараметрыЗаполнения.ФактическаяСумма;
	СоздаватьПоступления = ПараметрыЗаполнения.СоздаватьПоступления;
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствВДругуюКассу);

	ДокументОбъект		= Документы.РасходныйКассовыйОрдер.СоздатьДокумент();	
	ДокументОбъект.Дата = ДанныеПозиций.ПлатежнаяПозиция.Дата;
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	
	Платежныепозиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПозиций.Платежнаяпозиция);
	ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, Платежныепозиции, ПараметрыЗаполнения);
	
	Если СоздаватьПоступления Тогда
		ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
								Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойКассы);
		
		ДокументОбъект		= Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		ДокументОбъект.Дата = ДанныеПозиций.ПозицияПоступления.Дата;
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		ДокументОбъект.Записать();
		
		ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
		
		Платежныепозиции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеПозиций.ПозицияПоступления);
		ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, Платежныепозиции, ПараметрыЗаполнения);
	КонецЕсли; 

КонецПроцедуры

Процедура ЗаполнитьСдачуДенежныхСредствВБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
	
	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	ДатаДокумента	  = ДанныеПозиций.ПлатежнаяПозиция.Дата;
	
	СуммаДокумента	 = ПараметрыЗаполнения.СуммаДокумента;
	ФактическаяСумма = ПараметрыЗаполнения.ФактическаяСумма;

	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения,
							Перечисления.ХозяйственныеОперации.СдачаДенежныхСредствВБанк);
	
	ДокументОбъект 		= Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДанныеПозиций.ПлатежнаяПозиция.Дата;
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);

	Платежныепозиции = Новый Массив;
	Платежныепозиции.Добавить(ДанныеПозиций.ПлатежнаяПозиция);
	Платежныепозиции.Добавить(ДанныеПозиций.ПозицияПоступления);

	ЗаполнитьОтражениеФакта(ДокументОбъект.Ссылка, Платежныепозиции, ПараметрыЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьОтражениеФакта(ДокументОплаты, ДокументыПланирования, ПараметрыЗаполнения)
		
	СуммаКОплате = ПараметрыЗаполнения.ФактическаяСумма;
	СценарийФакт = ПараметрыЗаполнения.СценарийФакт;
	
	ОтражениеФакта		 = Документы.бит_ОтражениеФактаДДС.НайтиДокументОтражение(ДокументОплаты);
	ОтражениеФактаОбъект = ОтражениеФакта.ПолучитьОбъект();
	
	Позиции = ТаблицаДокументовПланирования(ДокументыПланирования);
	Документы.бит_ОтражениеФактаДДС.ЗаполнитьОтражениеФактаПоДокументамПланирования(ДокументОплаты, Позиции, СценарийФакт);
	
КонецПроцедуры

Функция ДанныеЗаполненияСписаниеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, ВидОперации)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", 				   РеквизитыОснования.Организация);
	ДанныеЗаполнения.Вставить("Подразделение", 				   Неопределено);
	ДанныеЗаполнения.Вставить("Валюта", 					   РеквизитыОснования.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", 		   ВидОперации);
	ДанныеЗаполнения.Вставить("БанковскийСчет",				   ДанныеПозиций.ПлатежнаяПозиция.БанковскийСчет);
	ДанныеЗаполнения.Вставить("БанковскийСчетПолучатель", 	   ДанныеПозиций.ПозицияПоступления.БанковскийСчет);
	ДанныеЗаполнения.Вставить("КассаПолучатель", 	  		   ДанныеПозиций.ПозицияПоступления.Касса);
	ДанныеЗаполнения.Вставить("ВидПлатежа", 			  	   "Электронно");
	ДанныеЗаполнения.Вставить("ОчередностьПлатежа", 	  	   5);
	ДанныеЗаполнения.Вставить("ТипПлатежногоДокумента",   	   Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение);
	ДанныеЗаполнения.Вставить("НазначениеПлатежа",			   ДанныеПозиций.ПлатежнаяПозиция.НазначениеПлатежа);
	ДанныеЗаполнения.Вставить("СуммаДокумента", 			   ПараметрыЗаполнения.СуммаДокумента);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Неопределено);
	
	ЗаполнитьПодразделениеСтатьяДДС(РеквизитыОснования, ДанныеПозиций.ПлатежнаяПозиция, ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияПоступлениеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, ВидОперации)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", 				   РеквизитыОснования.Организация);
	ДанныеЗаполнения.Вставить("Подразделение", 				   Неопределено);
	ДанныеЗаполнения.Вставить("Валюта", 					   РеквизитыОснования.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", 		   ВидОперации);
	ДанныеЗаполнения.Вставить("БанковскийСчет", 	   	   	   ДанныеПозиций.ПозицияПоступления.БанковскийСчет);
	ДанныеЗаполнения.Вставить("БанковскийСчетОтправитель", 	   ДанныеПозиций.ПлатежнаяПозиция.БанковскийСчет);
	ДанныеЗаполнения.Вставить("КассаОтправитель",		   	   ДанныеПозиций.ПлатежнаяПозиция.Касса);
	ДанныеЗаполнения.Вставить("ТипПлатежногоДокумента",		   Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение);
	ДанныеЗаполнения.Вставить("НазначениеПлатежа", 		  	   ДанныеПозиций.ПозицияПоступления.НазначениеПлатежа);
	ДанныеЗаполнения.Вставить("СуммаДокумента",		   	   	   ПараметрыЗаполнения.СуммаДокумента);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Неопределено);
	ДанныеЗаполнения.Вставить("НомерВходящегоДокумента", 	   "");
	ДанныеЗаполнения.Вставить("ДатаВходящегоДокумента", 	   '0001-01-01');
	
	ЗаполнитьПодразделениеСтатьяДДС(РеквизитыОснования, ДанныеПозиций.ПозицияПоступления, ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияСписаниеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, ВидОперации)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",   		   		   РеквизитыОснования.Организация);
	ДанныеЗаполнения.Вставить("Подразделение",				   Неопределено);
	ДанныеЗаполнения.Вставить("Валюта", 	   		   		   РеквизитыОснования.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", 		   ВидОперации);
	ДанныеЗаполнения.Вставить("Касса", 	   	 		   		   ДанныеПозиций.ПлатежнаяПозиция.Касса);
	ДанныеЗаполнения.Вставить("КассаПолучатель", 	   		   ДанныеПозиций.ПозицияПоступления.Касса);
	ДанныеЗаполнения.Вставить("БанковскийСчет", 	   		   ДанныеПозиций.ПозицияПоступления.БанковскийСчет);
	ДанныеЗаполнения.Вставить("СуммаДокумента",		   		   ПараметрыЗаполнения.СуммаДокумента);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Неопределено);

	ЗаполнитьПодразделениеСтатьяДДС(РеквизитыОснования, ДанныеПозиций.ПлатежнаяПозиция, ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, ВидОперации)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",   		   		   РеквизитыОснования.Организация);
	ДанныеЗаполнения.Вставить("Подразделение",				   Неопределено);
	ДанныеЗаполнения.Вставить("Валюта", 	   		   		   РеквизитыОснования.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", 		   ВидОперации);
	ДанныеЗаполнения.Вставить("БанковскийСчет", 	   	 	   ДанныеПозиций.ПлатежнаяПозиция.БанковскийСчет);
	ДанныеЗаполнения.Вставить("Касса", 	   	 		   		   ДанныеПозиций.ПозицияПоступления.Касса);
	ДанныеЗаполнения.Вставить("КассаОтправитель", 	   		   ДанныеПозиций.ПлатежнаяПозиция.Касса);
	ДанныеЗаполнения.Вставить("СуммаДокумента",		   		   ПараметрыЗаполнения.СуммаДокумента);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Неопределено);

	ЗаполнитьПодразделениеСтатьяДДС(РеквизитыОснования, ДанныеПозиций.ПозицияПоступления, ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Процедура ОпределитьСтатьюДДС(Контейнер, ДанныеПозиции, ДокументОснование)
	
	СтатьяОборотов = ДанныеПозиции.СтатьяОборотов;
	//ОбъектРасчетов = ДокументОснование.ОбъектРасчетов;
	//
	ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	//Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
	//	ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетов, "Договор");
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		СтатьяДДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "СтатьяДвиженияДенежныхСредств");
		Если ЗначениеЗаполнено(СтатьяДДС) Тогда
			Контейнер.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		СтатьяДДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяОборотов, "ОсновнаяСтатьяДДС");
		Если ЗначениеЗаполнено(СтатьяДДС) Тогда
			Контейнер.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтатьиДДС = РегистрыСведений.бит_СоответствияАналитик.ПолучитьЛевуюАналитику(
						ПредопределенноеЗначение("Справочник.бит_ВидыСоответствийАналитик.СтатьиДДС_СтатьиОборотов"), 
							СтатьяОборотов, ТекущаяДатаСеанса());
																
	Если СтатьиДДС.Количество() > 0 Тогда
		Контейнер.СтатьяДвиженияДенежныхСредств = СтатьиДДС[0];
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Контейнер.СтатьяДвиженияДенежныхСредств) Тогда
		ВидОперации	   = бит_Казначейство.ХозяйственнаяОперацияУП(ДокументОснование.ХозяйственнаяОперация);
		СтатьяКандидат = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(ВидОперации);
		
		Если ЗначениеЗаполнено(СтатьяКандидат) Тогда
			Контейнер.СтатьяДвиженияДенежныхСредств = СтатьяКандидат;
		КонецЕсли;	
	КонецЕсли; 

КонецПроцедуры

Функция ЗаполнитьПодразделениеСтатьяДДС(Основание, ДанныеПозиции, ДанныеЗаполнения)
	
	ОпределитьСтатьюДДС(ДанныеЗаполнения, ДанныеПозиции, Основание);
	
	Если ТипЗнч(ДанныеПозиции.Позиция) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
		Подразделение = Документы.бит_кзн_ПлатежнаяПозиция.ПодразделениеДополнительныеИзмерения(ДанныеПозиции.Позиция);
	Иначе
		Подразделение = Документы.бит_кзн_ПозицияПоступления.ПодразделениеДополнительныеИзмерения(ДанныеПозиции.Позиция);
	КонецЕсли;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ДанныеЗаполнения.Подразделение = Подразделение;
	КонецЕсли;
		
КонецФункции

Функция ТаблицаДокументовПланирования(ДанныеПозиций)

	ОписаниеТипаПозиции = Новый ОписаниеТипов("ДокументСсылка.бит_кзн_ПозицияПоступления, ДокументСсылка.бит_кзн_ПлатежнаяПозиция");
	
	ТаблицаДокументов = Новый ТаблицаЗначений;	
	ТаблицаДокументов.Колонки.Добавить("ИдентификаторСтроки", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаДокументов.Колонки.Добавить("Позиция", 			  ОписаниеТипаПозиции);
	ТаблицаДокументов.Колонки.Добавить("Сумма", 			  Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
	
	Для каждого Элемент Из ДанныеПозиций Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДокументов.Добавить(), Элемент);
	КонецЦикла;

	Возврат ТаблицаДокументов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
